{
  "nav_menu": {
    "home": "Inicio",
    "about": "Acerca de",
    "resume": "Curriculum",
    "portfolio": "Portafolio",
    "services": "Servicios",
    "passions": "Pasiones",
    "contact": "Contacto"
  },
    "whatAmI": {
    "i_am": "Soy un ",
    "software_eng": "Ingeniero de Software锔",
    "developer": "Desarrollador锔",
    "fullstack_developer": "Desarrollador Fullstack锔",
    "frontend_developer": "Desarrollador Frontend锔",
    "watercolor_artist": "Pintor de Acuarela",
    "padel_coach": "Entrenador de Padel",
    "karaoke_singer": "Cantante de Karaoke"
  },
    "about":{
    "description":"Soy ingeniero de software con m谩s de 10 a帽os de experiencia en desarrollo web. Cuento con una s贸lida base en JavaScript, TypeScript y diversos frameworks como React y Angular. Me apasiona construir aplicaciones escalables y mantenibles, y disfruto ideando y creando propuestas para diferentes proyectos. Comenc茅 como un joven desarrollador freelance y luego evolucion茅 a un joven emprendedor liderando mi propio equipo de desarrollo, trabajando principalmente para una empresa internacional de log铆stica y comercio con sede en la ciudad de Veracruz, llamada Grupo CICE, como uno de sus principales proveedores de desarrollo m贸vil. En un futuro no muy lejano, aspiro a convertirme en arquitecto de software.",
    "subtitle":"Desarrollador Fullstack JS  / Pintor de Acuarela / Entrenador de Padel",
    "description2":"Soy ingeniero de software fullstack con m谩s de 10 a帽os de experiencia en la creaci贸n de soluciones robustas y escalables usando JavaScript y TypeScript. Mi experiencia abarca desde el desarrollo de frontends interactivos con React y Angular hasta la implementaci贸n de APIs eficientes con Node.js y Express, as铆 como la gesti贸n de bases de datos SQL y NoSQL. Apasionado por la arquitectura de software y la optimizaci贸n de sistemas, me dedico a transformar conceptos complejos en productos digitales eficientes y de alto rendimiento. Mi visi贸n hol铆stica, tambi茅n cultivada a trav茅s de mi rol como artista de acuarela y entrenador de p谩del, me permite abordar los desaf铆os con creatividad y una estrategia s贸lida."
  }
 
}
