{
  "nav_menu": {
    "home": "Inicio",
    "about": "Acerca de",
    "resume": "Curriculum",
    "portfolio": "Portafolio",
    "services": "Servicios",
    "passions": "Pasiones",
    "contact": "Contacto"
  },
  "whatAmI": {
    "i_am": "Soy un ",
    "software_eng": "Ingeniero de Software锔",
    "developer": "Desarrollador锔",
    "fullstack_developer": "Desarrollador Fullstack锔",
    "frontend_developer": "Desarrollador Frontend锔",
    "watercolor_artist": "Pintor de Acuarela",
    "padel_coach": "Entrenador de Padel",
    "karaoke_singer": "Cantante de Karaoke"
  },
  "about": {
    "description": "Soy ingeniero de software con m谩s de 10 a帽os de experiencia en desarrollo web. Cuento con una s贸lida base en JavaScript, TypeScript y diversos frameworks como React y Angular. Me apasiona construir aplicaciones escalables y mantenibles, y disfruto ideando y creando propuestas para diferentes proyectos. Comenc茅 como un joven desarrollador freelance y luego evolucion茅 a un joven emprendedor liderando mi propio equipo de desarrollo, trabajando principalmente para una empresa internacional de log铆stica y comercio con sede en la ciudad de Veracruz, llamada Grupo CICE, como uno de sus principales proveedores de desarrollo m贸vil. En un futuro no muy lejano, aspiro a convertirme en arquitecto de software.",
    "subtitle": "Desarrollador Fullstack JS  / Pintor de Acuarela / Entrenador de Padel",
    "description2": "Soy ingeniero de software fullstack con m谩s de 10 a帽os de experiencia en la creaci贸n de soluciones robustas y escalables usando JavaScript y TypeScript. Mi experiencia abarca desde el desarrollo de frontends interactivos con React y Angular hasta la implementaci贸n de APIs eficientes con Node.js y Express, as铆 como la gesti贸n de bases de datos SQL y NoSQL. Apasionado por la arquitectura de software y la optimizaci贸n de sistemas, me dedico a transformar conceptos complejos en productos digitales eficientes y de alto rendimiento. Mi visi贸n hol铆stica, tambi茅n cultivada a trav茅s de mi rol como artista de acuarela y entrenador de p谩del, me permite abordar los desaf铆os con creatividad y una estrategia s贸lida.",
    "description3": "Mi trayectoria profesional se ha centrado en el desarrollo de sistemas complejos y cr铆ticos para la misi贸n, siempre con una s贸lida base en la programaci贸n orientada a objetos para garantizar la mantenibilidad y escalabilidad del c贸digo. Si bien mi principal fortaleza radica en el desarrollo, mi creciente inter茅s en la arquitectura de software me impulsa a dise帽ar sistemas desde una perspectiva integral, considerando la escalabilidad, la seguridad y la eficiencia desde la concepci贸n. Poseo conocimientos sobre servicios en la nube y estoy profundizando activamente mi comprensi贸n de las arquitecturas sin servidor y los patrones de dise帽o en la nube para liderar proyectos de mayor escala.",
    "heres_some_facts": "Aqu铆 hay algunos datos sobre m铆:"
  },
  "readMore": "Quieres saber m谩s...",
  "resume": {
    "download_resume": "Descarga mi curr铆culum"
  },
  "months": "meses",
  "years": "a帽os",
  "engineer": "Ingeniero",
  "stats": {
    "happy_clients": {
      "title": "Clientes Felices",
      "subtext": "y contando..."
    },
    "projects": {
      "title": "Proyectos",
      "subtext": "innovadores y eficientes"
    },
    "hours_of_support": {
      "title": "Horas de Soporte",
      "subtext": "dedicadas a nuestros clientes"
    },
    "hard_workers": {
      "title": "Trabajadores a cargo",
      "subtext": "a quienes gui茅 y desarroll茅"
    }
  },
  "skills": {
    "title": "Habilidades",
    "description": "Con una s贸lida base en el desarrollo web, mis habilidades se centran en construir soluciones digitales completas y eficientes. A continuaci贸n, presento un desglose de mis competencias t茅cnicas fundamentales, que abarcan desde la creaci贸n de interfaces de usuario interactivas hasta la gesti贸n de la l贸gica del lado del servidor y la manipulaci贸n de bases de datos, utilizando las tecnolog铆as m谩s relevantes de la industria."
  }

}
